app/views/admin/index.html.erb

    <%= f.email_field :email, placeholder: "Email" %>
    <%= f.select :role, User.roles.keys.map { |w| [w.humanize, w] }, include_blank: "Select a role" %>
---
SELECT "users".* FROM "users"