app/views/posts/index.html.erb

  Posts:
  <%= Post.count %>
---
SELECT "posts".* FROM "posts"
SELECT COUNT(*) FROM "posts"