app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT "users".* FROM "users"

  def show
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def ban
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "unlock_token" = $1, "locked_at" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["unlock_token", "[FILTERED]"], ["locked_at", "2023-08-11 09:16:52.640470"], ["updated_at", "2023-08-11 09:16:52.792832"], ["id", 1]]

  def set_user
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]