app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."email" IS NULL ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def self.from_omniauth(access_token)
    user = User.where(email: access_token.info.email).first