app/controllers/users/sessions_controller.rb

  def create
    auth = request.env['omniauth.auth']
    @user = User.find_by(email: auth.info.email) || User.create(email: auth.info.email)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "demo@demo.com"], ["LIMIT", 1]]

  def check_failed_attempts
    user = User.find_by(email: params[:user][:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "demo@demo.com"], ["LIMIT", 1]]

  def check_user_confirmation
    user = User.find_by_email(params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "demo@demo.com"], ["LIMIT", 1]]